Revit 2026 API

# ExportFontTableIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<ExportFontKey, ExportFontInfo> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportFontKey, ExportFontInfo)
	Get
```
```cpp
public:
virtual property KeyValuePair<ExportFontKey^, ExportFontInfo^> Current {
	KeyValuePair<ExportFontKey^, ExportFontInfo^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<ExportFontKey, ExportFontInfo> with get
override Current : KeyValuePair<ExportFontKey, ExportFontInfo> with get
```

#### Property Value

KeyValuePairExportFontKey, ExportFontInfo

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ExportFontTableIterator Class

Autodesk.Revit.DB Namespace